// 自動生成されたコードです。変更しないでください。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":
            case "missile":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. f f f f f . . . . . . . . . . 
. . f 1 2 2 f . . . . . . . . . 
. . f 1 1 1 1 f . . . . . . . . 
2 5 f 1 1 1 1 f f f f f f f f . 
2 5 f 1 1 1 1 1 1 1 1 1 2 2 2 f 
5 2 f 1 1 1 1 f f f f f f f f . 
. . f 1 1 1 1 f . . . . . . . . 
. . f 1 2 2 f . . . . . . . . . 
. f f f f f . . . . . . . . . . 
. . . . . . . . . . . . . . . 3 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image2":
            case "player":return img`
. . . . . . . . . . . . . . . . 
. . . . 5 a a a 8 8 2 . . . . . 
. . . . f 9 9 f . . . . . . . . 
f . . . f 9 1 9 f . . . . . . . 
a f . . f 9 1 1 9 f . f f . . . 
f 1 f f f 9 1 1 1 d f 9 9 f . . 
f 1 1 1 1 1 1 1 1 1 1 1 1 9 f . 
f 1 a a 8 1 1 1 1 1 a a a 1 9 f 
f 1 8 8 a 1 1 1 1 1 8 8 8 1 9 f 
f 1 1 1 1 1 1 1 1 1 1 1 1 9 f . 
f 1 f f f 1 1 1 1 9 f d d f . . 
8 f . . f 1 1 1 9 f . f f . . . 
f . . . f 1 1 9 f . . . . . . . 
. . . . f 9 9 f . . . . . . . . 
. . . . 5 a a a 8 8 2 . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image3":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image4":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image5":
            case "bogy":return img`
. . . . 5 8 8 8 c c c . . . . . 
. . . . . . . 8 8 8 8 . . . . . 
. . . . . . 8 c c c c c . . . . 
. . . . . . 8 c f f f f . . . 8 
. . . . . 8 8 8 f f f f f . 8 8 
. . 8 8 8 8 c f f f f 8 8 8 f 8 
. 8 f f f f f f f f f f f f f 8 
8 f 8 a a 5 f f f 8 c c c f f 8 
8 f 8 a a 5 f f f f f f f f f 8 
. 8 f f f f f f f f f 8 8 8 f 8 
. . 8 8 8 8 f f f f f f f . 8 8 
. . . . . 8 8 8 f f f c . . . 8 
. . . . . . 8 f f f f c . . . . 
. . . . . . 8 c c c c . . . . . 
. . . . . . 8 8 8 8 8 . . . . . 
. . . . 5 8 8 8 c c c . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
